<!doctype html><html lang=en-us><head><meta charset=utf-8><meta http-equiv=x-ua-compatible content="IE=edge"><meta name=viewport content="width=device-width,initial-scale=1"><meta name=author content="Nebula Graph"><meta name=twitter:card content="summary_large_image"><meta name=twitter:site content="@NebulaGraph"><meta name=twitter:creator content="@NebulaGraph"><meta name=twitter:domain content="nebula-graph.io"><meta name=twitter:title content="从天津百货大楼 5 病例“迷局”见新冠病毒传播路径"><meta property="twitter:title" content="从天津百货大楼 5 病例“迷局”见新冠病毒传播路径"><meta name=twitter:description content="天津某百货大楼内部相继出现 5 例新冠肺炎确诊病例，从起初的 3 个病例来看，似乎找不到任何流行病学上的关联性。在这种背景之下，作为技术人员可以通过什么技术来找寻病例之间的联系呢？"><meta name=og:description content="天津某百货大楼内部相继出现 5 例新冠肺炎确诊病例，从起初的 3 个病例来看，似乎找不到任何流行病学上的关联性。在这种背景之下，作为技术人员可以通过什么技术来找寻病例之间的联系呢？"><meta name=twitter:image content="/nebula-website/cn/posts/detect-corona-virus-spreading-with-graph-database/Medium%20_hu822a77c330898c64a21cacd280374e67_1818564_600x0_resize_box_2.png"><meta name=og:image content="/nebula-website/cn/posts/detect-corona-virus-spreading-with-graph-database/Medium%20_hu822a77c330898c64a21cacd280374e67_1818564_600x0_resize_box_2.png"><meta name=description content="天津某百货大楼内部相继出现 5 例新冠肺炎确诊病例，从起初的 3 个病例来看，似乎找不到任何流行病学上的关联性。在这种背景之下，作为技术人员可以通过什么技术来找寻病例之间的联系呢？"><meta name=generator content="Hugo 0.65.3"><title>从天津百货大楼 5 病例“迷局”见新冠病毒传播路径</title><link rel="shortcut icon" href=/nebula-website/favicon.ico><link rel=stylesheet href=/nebula-website/css/bootstrap.min.css type=text/css><link href="//fonts.googleapis.com/css?family=Open+Sans:300italic,400italic,600italic,700italic,800italic,400,300,600,700,800" rel=stylesheet type=text/css><link href="//fonts.googleapis.com/css?family=Merriweather:400,300,300italic,400italic,700,700italic,900,900italic" rel=stylesheet type=text/css><link rel=stylesheet href=/nebula-website/font-awesome/css/font-awesome.min.css type=text/css><link rel=stylesheet href=/nebula-website/css/creative.css type=text/css><link rel=stylesheet href=/nebula-website/css/modals.css type=text/css><link rel=stylesheet href=/nebula-website/css/animate.min.css type=text/css><link rel=stylesheet href=/nebula-website/css/custom/index.css type=text/css><!--[if lt IE 9]><script src=https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js></script><script src=https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js></script><![endif]--><script src=/nebula-website/js/jquery.js></script><script async src="https://www.googletagmanager.com/gtag/js?id=UA-60523578-5"></script><script>window.dataLayer=window.dataLayer||[];function gtag(){dataLayer.push(arguments);}
gtag('js',new Date());gtag('config','UA-60523578-5');</script></head><body id=page-top><nav id=mainNav class="navbar navbar-default navbar-fixed-top"><div class=container-fluid><div class=navbar-header><div class=github-star><a class=github-button href=https://github.com/vesoft-inc/nebula data-icon=octicon-star data-show-count=true aria-label="Star vesoft-inc/nebula on GitHub">Star</a></div><button type=button class="navbar-toggle collapsed" data-toggle=collapse data-target=#bs-example-navbar-collapse-1>
<span class=sr-only>Toggle navigation</span>
<span class=icon-bar></span><span class=icon-bar></span><span class=icon-bar></span></button>
<a class="navbar-brand page-scroll" href=/></a></div><div class="collapse navbar-collapse" id=bs-example-navbar-collapse-1><ul class="nav navbar-nav" id=nav><li class=github-star id=github-star><a class=github-button href=https://github.com/vesoft-inc/nebula data-size=large data-show-count=true aria-label="Star vesoft-inc/nebula on GitHub">Star</a></li><li><a href=https://docs.nebula-graph.io/ target=_blank>文档</a></li><li><a href=/cn/posts target>博客</a></li><li><a href=https://discuss.nebula-graph.io/ target=_blank>论坛</a></li><li><a href=#contact_us target onclick=contactUsClick()>联系我们</a></li><li class="dropdown navbar-right"><a class=dropdown-toggle data-toggle=dropdown href=# role=button aria-haspopup=true aria-expanded=false><img src=/images/language120x120.png>
<span class=caret></span></a><ul class=dropdown-menu><li class=nav-item><a class=dropdown-item href=/en target>English</a></li><li class=nav-item><a class=dropdown-item href=/cn target>中文</a></li></ul></li><li id=navbar-right><a href=https://github.com/vesoft-inc/nebula-web-docker target=_blank>Nebula Studio</a></li></ul></div></div></nav><script>function contactUsClick(){$('html,body').animate({scrollTop:document.documentElement.scrollHeight},800)
return false;}</script><main id=top class=blog-detail><div class=wrapper><div class=inner><section class=blog-content><h1>从天津百货大楼 5 病例“迷局”见新冠病毒传播路径</h1><div class=blog-metas><div class=meta><img src=/images/writer.png width=16px height=16px>
<span>吴敏, 清蒸</span></div><div class=meta><img src=/images/calendar.png width=16px height=16px>
<span>2020-02-06</span></div><div class="tags meta"><img src=/images/tag.png width=16px height=16px>
<a href=/nebula-website/cn//tags/%e5%ba%94%e7%94%a8%e5%ae%9e%e8%b7%b5>应用实践</a></div></div><p><img src=https://nebula-blog.azureedge.net/nebula-blog/nCoV01.png alt=nCov.png></p><p>天津某百货大楼内部相继出现 5 例新冠肺炎确诊病例，从起初的 3 个病例来看，似乎找不到任何流行病学上的关联性。在这种背景之下，作为技术人员可以通过什么技术来找寻病例之间的联系呢？</p><h2 id=摘要>摘要</h2><p>最初，nCoV 新冠病毒的扩散过程是由一个人（节点）向各其他人（节点）扩散的树状结构，但随着病毒的变异和人员交叉感染、“百家宴”、“联欢会”、“春运”等人员聚集，疫情扩散为网状结构。可以使用图数据库来存储相关人员、地理位置、感染时间等数据，本文将使用图数据库 <strong>Nebula Graph</strong> 作为工具，带大家一起探讨疫情的传播路径，并找到相关的疑似病例。</p><h2 id=天津案例简述>天津案例简述</h2><p>下面用 Usr1、Usr2、Usr3、Usr4、Usr5 来代指这 5 例病例，看一下他们的行为轨迹：</p><p>Usr1 信息:</p><ul><li>Usr1 于 1 月 24 日开始发热，在 1 月 22 日至 1 月 30 日期间在天津百货大厦 A 区工作，于 1 月 31 日确诊；</li><li>Usr2 信息：Usr2 为 Usr1 丈夫，于 1 月 25 日开始出现腹泻症状，于 2 月 1 日确诊；</li><li>Usr3 信息：Usr3 于 1 月 18 日接触过一个疑似病例，而后在天津百货大厦 B 区工作，于 1 月 24 日开始发热，于 2 月 1 日确诊；</li><li>Usr4 信息：Usr4 于 1 月 12 日、13 日接触过疑似病例，而后在天津百货大厦 C 区工作，于 1 月 21 日开始发热，于 2 月 1 日确诊；</li><li>Usr5 信息：Usr5 于 1 月 23 日下午 16 点到 23 点到过天津百货大厦 A、B、C 区，1 月 29 日开始发热，2 月 2 日确诊；</li></ul><p>下面我们来建立一个传播路径的模型。</p><h2 id=ncov-新冠病的数据分析>nCoV 新冠病的数据分析</h2><p>以我们现有的资料显示，本次 nCoV 的传播路径为人传人（图 Demo1），即一个点通过特定访问路径连接到一个点。单个节点看来传播路径为一个树形结构（图 Demo2）——确诊病人 A 感染 B，B 再感染 C，C 再感染 D…。根据现在疫情传播情况，存在多个确诊病人，所以整个传播链路呈网状结构（图 Demo3）。而无论是树形结构还是网状结构都很适合用图（网络）这种数据结构来存储、查询和分析。</p><p><img src=https://nebula-blog.azureedge.net/nebula-blog/nCoV02.png alt=demo.png></p><h2 id=图模型>图模型</h2><p>在建模之前我们需要清楚人和人之间的关系载体是什么？根据现有的病例信息，我们知道 A 和 B 会的接触场景最常见的是：**同一个时间段逗留在某个相同的空间。**这也是本次疫情筛选需隔离人群的重要指标：是否和确诊 / 疑似病例在酒店、火车、超市有过密切接触。</p><p><img src=https://nebula-blog.azureedge.net/nebula-blog/nCoV03.png alt=modle.png></p><p>可见最小模型中有两类节点 <code>Person</code> 和 <code>Space</code> ，关系为 <code>stay</code> 。最小模型有了，那么我们需要 Person 和 Space 的什么信息呢？</p><p>Person 类型节点的属性：</p><ul><li><em>ID</em>：Person 的身份证，用来标识人</li><li><em>HealthStatus</em>：健康状态，有 2 种状态<ul><li>Health：健康</li><li>Sick：生病</li></ul></li><li><em>SickTime</em>：发热开始时间，可以用来追溯病人发病的先后次序</li></ul><p>Space 类型节点的属性：</p><ul><li><em>ID</em>：Space ID，用来唯一标识 space</li><li><em>Address</em>：space 地址</li></ul><p><img src=https://nebula-blog.azureedge.net/nebula-blog/nCoV04.png alt=model.png></p><p>我们构建完 Person 和 Space 的模型之后，再构建人和位置之间的关系：</p><p>在 stay 关系上，记录有逗留的<strong>起始时间</strong>和<strong>终止时间</strong>。这样就可以帮助我们判断两个人是否有过时间和空间上的交集。</p><h2 id=天津案例的建模>天津案例的建模</h2><p>构建完最小模型之后，我们来分析一下天津病例中的信息，将模型应用在这个案例中。并通过图数据库 Nebula Graph <strong>构建病例间关系、找寻病例1 的发病原因——病例1 怎么被传染的，及病例1 确诊后我们需要观察/隔离哪些人</strong>？</p><p>整个模型的示意如下：</p><p><img src=https://nebula-blog.azureedge.net/nebula-blog/nCoV05.png alt=model.png></p><h3 id=数据录入>数据录入</h3><p>Usr1:</p><ul><li>Person 信息：ID 2020020201，HealthStatus：Sick，SickTime：20200124；</li><li>Stay Time：起始时间 1 月 23 日 12 点，终止时间 18 点；</li><li>Place 信息：天津百货大厦 A 区；</li><li>Stay Time：起始时间 1 月 23 日 18 点，终止时间 24日 8 点；</li><li>Place 信息：天津市和平区 A 小区；</li></ul><p>Usr2:</p><ul><li>Person 信息：ID 2020020202，HealthStatus：Sick，SickTime：20200125；</li><li>Stay Time：起始时间 1 月 23 日 12 点，终止时间 23 点；</li><li>Place 信息：天津市和平区 A 小区；</li></ul><p>Usr3:</p><ul><li>Person 信息：ID 2020020203，HealthStatus：Sick，SickTime：20200125；</li><li>Stay Time：起始时间 1 月 23 日 15 点，终止时间 19 点；</li><li>Place 信息：天津百货大厦 B 区；</li><li>Stay Time：起始时间 1 月 23 日 12 点，终止时间 23 点；</li><li>Place 信息：天津市河西区 B 小区；</li></ul><p>Usr4:</p><ul><li>Person 信息：ID 2020020204，HealthStatus：Sick，SickTime：20200121；</li><li>Stay Time：起始时间 1 月 23 日 11 点，终止时间 20 点；</li><li>Place 信息：天津南开区某火锅店；</li><li>Stay Time：起始时间 1 月 23 日 20 点，终止时间 23 点；</li><li>Place 信息：天津市滨海区 B 小区；</li></ul><p>Usr5:</p><ul><li>Person 信息：ID 2020020205，HealthStatus：Health，SickTime：NULL（无）；</li><li>Stay Time：起始时间 1 月 23 日 11 点，终止时间 15 点；</li><li>Place 信息：天津南开区某火锅店；</li><li>Stay Time：起始时间 1 月 23 日 16 点，终止时间 23 点；</li><li>Place 信息：天津百货大厦 A、B、C 区；</li></ul><p>将它导入到 NebulaGraph 中， 建立人和空间之间的关系。这里以 Usr1 的轨迹为例，其余几份病例类似。</p><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-bash data-lang=bash>-- 插入 Usr1
INSERT VERTEX person<span style=color:#f92672>(</span>ID, HealthStatus, SickTime<span style=color:#f92672>)</span> VALUES 1:<span style=color:#f92672>(</span>2020020201, ‘Sick’, <span style=color:#e6db74>&#39;2020-01-24&#39;</span><span style=color:#f92672>)</span>; 
-- 插入 位置 “天津百货大厦 A 区”
INSERT VERTEX place<span style=color:#f92672>(</span>name<span style=color:#f92672>)</span> VALUES 101:<span style=color:#f92672>(</span><span style=color:#e6db74>&#34;天津百货大厦 A 区&#34;</span><span style=color:#f92672>)</span>
-- Usr1 到 “天津百货大厦 A 区”
INSERT EDGE stay <span style=color:#f92672>(</span>start_time, end_time<span style=color:#f92672>)</span> VALUES <span style=color:#ae81ff>1</span> -&gt; 101: <span style=color:#f92672>(</span><span style=color:#e6db74>&#39;2020-01-23 12:00:00&#39;</span>， <span style=color:#e6db74>&#39;2020-01-23 18:00:00&#39;</span><span style=color:#f92672>)</span>
-- 插入 位置 “天津市和平区 A 小区”
INSERT VERTEX place<span style=color:#f92672>(</span>name<span style=color:#f92672>)</span> VALUES 102:<span style=color:#f92672>(</span><span style=color:#e6db74>&#34;天津市和平区 A 小区&#34;</span><span style=color:#f92672>)</span>
-- Usr1 回家
INSERT EDGE stay <span style=color:#f92672>(</span>start_time, end_time<span style=color:#f92672>)</span> VALUES <span style=color:#ae81ff>1</span> -&gt; 102: <span style=color:#f92672>(</span><span style=color:#e6db74>&#39;2020-01-23 18:00:00&#39;</span>， <span style=color:#e6db74>&#39;2020-01-24 8:00:00&#39;</span><span style=color:#f92672>)</span>
</code></pre></div><h3 id=病例数据分析>病例数据分析</h3><p>数据导入后，让我们一步步揭开病例1 被感染之谜：</p><h4 id=1-查询-usr1-在1-月-23-日-15-点至-23-点之间去过哪里>1. 查询 Usr1 在 1 月 23 日 15 点至 23 点之间去过哪里</h4><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-bash data-lang=bash>$PlaceUsr1Goto <span style=color:#f92672>=</span> GO FROM <span style=color:#ae81ff>1</span> OVER stay WHERE stay.start_time &gt; <span style=color:#e6db74>&#39;2020-01-23 00:00:00&#39;</span> AND 
stay.start_time &lt; <span style=color:#e6db74>&#39;2020-01-24 00:00:00&#39;</span>
YIELD stay._dst AS placeid

<span style=color:#f92672>========================================================================</span>
| Place                 | star_time           | end_time               |
<span style=color:#f92672>========================================================================</span>
| 天津百货大厦 A 区       | 2020-01-23 12:00:00 | 2020-01-23 18:00:00    |
------------------------------------------------------------------------
| 天津市和平区 A 小区     | 2020-01-23 18:00:00  | 2020-01-24 8:00:00    |
------------------------------------------------------------------------
</code></pre></div><h4 id=2-查询这段时间-usr1-是否接触过任何已发病的病例>2. 查询这段时间 Usr1 是否接触过任何（已发病的）病例</h4><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-bash data-lang=bash>GO FROM $PlaceUsr1Goto OVER stay REVERSELY WHERE $$.person.HealthStatus <span style=color:#f92672>==</span> <span style=color:#e6db74>&#39;Sick&#39;</span> 
   AND $$.person.SickTime &lt;<span style=color:#f92672>=</span> <span style=color:#e6db74>&#34;2020-01-23&#34;</span>
   
<span style=color:#f92672>========================================================================</span>
| Person                | HealthStatus           | SickTime             |
<span style=color:#f92672>========================================================================</span>
| <span style=color:#ae81ff>2</span>                     | Sick                   | 2020-01-25           |
------------------------------------------------------------------------
| <span style=color:#ae81ff>5</span>                     | Health                 | NULL                 |
------------------------------------------------------------------------
</code></pre></div><p>很奇怪，在 Usr1 发病的时候(2020-01-24)，他接触的人群里面并没有发热患者。那会不会是这些人又接触过其他的患者呢（从而成为携带者），让我们继续分析。</p><h4 id=3-查询这些人又接触过谁>3. 查询这些人又接触过谁</h4><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-bash data-lang=bash>$PersonUsr1Meet <span style=color:#f92672>=</span> GO FROM $PlaceUsr1Goto OVER stay REVERSELY YIELD stay._dst AS id
$PlaceThosePersonGoto <span style=color:#f92672>=</span> GO FROM $PersonUsr1meet.id OVER stay YIELD stay.start_time AS start
    stay.end_time AS end
    
<span style=color:#f92672>=========================================================================</span>
| Person | Place            | start_time          | end_time            |
<span style=color:#f92672>=========================================================================</span>
| <span style=color:#ae81ff>5</span>      | 天津南开区某火锅店 | 2020-01-23 11:00:00 | 2020-01-23 15:00:00 |
-------------------------------------------------------------------------
| <span style=color:#ae81ff>5</span>      | 天津百货大厦 A 区  | 2020-01-23 16:00:00 | 2020-01-23 23:00:00 |
-------------------------------------------------------------------------
| <span style=color:#ae81ff>5</span>      | 天津百货大厦 B 区  | 2020-01-23 16:00:00 | 2020-01-23 23:00:00 |
-------------------------------------------------------------------------
| <span style=color:#ae81ff>5</span>      | 天津百货大厦 C 区  | 2020-01-23 16:00:00 | 2020-01-23 23:00:00 |
-------------------------------------------------------------------------

GO FROM $PlaceThosePersonGoto.id FROM stay REVERSELY 
    WHERE $$.person.HealthStatus <span style=color:#f92672>==</span> <span style=color:#e6db74>&#39;Sick&#39;</span>
    AND $$.person.SickTime &lt;<span style=color:#f92672>=</span> <span style=color:#e6db74>&#34;2020-01-23&#34;</span>  -- 在此之前已经发病
    AND <span style=color:#f92672>((</span>stay.start_time &gt; $PlaceTHosePersonGoto.start 
    	AND stay.start_time &lt; $PlaceThosePersonGoto.end<span style=color:#f92672>)</span>
    	OR <span style=color:#f92672>(</span>stay.end_time &gt; $PlaceTHosePersonGoto.start
    	AND stay.end_time &lt; $PlaceThosePersonGoto.end<span style=color:#f92672>)</span>		-- 并且有过接触
    <span style=color:#f92672>)</span>  
    
<span style=color:#f92672>=========================================================================================</span>
| Person1 | HealthStatus | SickTime   | stay.start_time     | Place           | Person2 |
<span style=color:#f92672>=========================================================================================</span>
| <span style=color:#ae81ff>4</span>       | Sick         | 2020-01-21 | 2020-01-23 11:00:00 |天津南开区某火锅店 | <span style=color:#ae81ff>5</span>        |
-----------------------------------------------------------------------------------------
</code></pre></div><p>我们发现，虽然 Usr1 在 1 月 23 日 12 点到 1 月 24 日 8 点之间接触的人（Usr2, Usr5）都还没有发热，但是 Usr5 却在之前接触过发热病人 Usr4。至此，我们找到了这条传播链路：</p><p>Usr4 在 1 月 21 日发病。发病后，他仍前往天津南开区某火锅店（1 月 23 日 11 点- 20 点）。在这里，他接触到（当时健康的）Usr5（1 月 23 日 11 点-15 点）。在接触过程中使得 Usr5 成为一个携带者。之后 Usr5 前往天津百货大厦 A、B、C 区（ 1 月 23 日 16 - 23 点），在这段时间内，他将病毒传染给在 A 区上班的 Usr1（1 月 23 日 12 点 - 18 点）。最终 Usr1 在 1 月 24 日发病。</p><h4 id=4-之后排查需要隔离哪些人>4. 之后排查需要隔离哪些人</h4><p>Usr1 确诊之后，我们需要查看她在哪些时候到过哪些地方。而对应这个时间段相同地点内，又有哪些人同她接触。 我们判断这些亲密接触者，需要重点隔离和观察。</p><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-bash data-lang=bash>GO FROM <span style=color:#ae81ff>1</span> OVER stay YIELD stay.start_time AS usr1_start, 
stay.end_time AS usr1_end, stay._dst AS placeid
| GO FROM $placeid OVER stay REVERSELY WHERE 
<span style=color:#f92672>(</span>stay.start_time &gt; usr1_start AND stay.start_time &lt; usr1_end<span style=color:#f92672>)</span>
OR <span style=color:#f92672>(</span>stay.end_time &lt; usr1_start AND stay.end_time &lt; usr1_end<span style=color:#f92672>)</span>
YIELD $$.person.ID

<span style=color:#f92672>=============================================================================</span>
| Person | Place 								| star_time           | end_time            |
<span style=color:#f92672>=============================================================================</span>
| <span style=color:#ae81ff>2</span>      | 天津市和平区 A 小区    | 2020-01-23 12:00:00 | 2020-01-23 13:00:00 |
-----------------------------------------------------------------------------
</code></pre></div><p>可以发现 Usr1 和 Usr2 在天津市和平区 A 小区有过交集，这使得 Usr2 需要被重点观察**。**</p><h2 id=传播路径可视化展示>传播路径可视化展示</h2><p>上面这段分析过程，也可以使用图形化界面的方式来交互分析，这样更加直观。</p><p><img src=https://nebula-blog.azureedge.net/nebula-blog/nCoV06.png alt=Studio.png></p><p>当然，如果有非常大批量的关注点（例如上千万离开湖北的潜在人员和他们的二次三次传播轨迹），通过批量程序查询的方式会更加高效。</p><h2 id=小结>小结</h2><p>由于春节返乡和一些不可描述的影响，导致冠状病毒的大面积扩散。从报道和社交媒体上可以看到，各个社区、村庄、企业都采用了相当严格的隔离措施，要求个人每日汇报行踪和健康状态，并密切跟踪从疫区来的人员。这样十几亿人的隔离和追踪需要极大的人力物力和动员能力，充分体现了“集中力量办大事”的制度优越性。</p><p>但另外一方面，这样的自我申报和层层统计，非常依赖个人的自觉，也依赖于汇报体系的响应速度。特别是当生死攸关（或者一刀切的歧视政策）的时候，个人反而有很强的动机隐瞒过去的行为和病史，导致未能得到及时的隔离和救治，也极大的影响了需要专业分工合作的现代经济生产活动。</p><p>另外一方面，随着大数据技术的发展和智能设备的普及，使得安防、运营商、交通、医疗部门的数据体系已经建立的较为全面。</p><p>在天津这个案例中，只选取了少数几个病例和场所作为示意，我们相信如果能够结合前述数据体系，并通过采用新的大数据和人工智能技术，能够极大提高定位和隔离疑似患者的速度，大大减少各种“有效人传人”和“超级毒王”的发生，减少一线医疗和社区工作人员的压力。也能降低全社会的全面隔离时间，尽快恢复经济活动。</p><p><img src=https://nebula-blog.azureedge.net/nebula-blog/nCoV07.png alt=table>
<img src=https://nebula-blog.azureedge.net/nebula-blog/nCoV08.png alt=news></p><h2 id=参考资料>参考资料</h2><ul><li>堪比推理小说！天津百货大楼5病例“迷局”： <a href=http://www.bjd.com.cn/a/202002/03/WS5e37d067e4b002ffe994092e.html>http://www.bjd.com.cn/a/202002/03/WS5e37d067e4b002ffe994092e.html</a></li><li>图数据库技术 <a href=https://github.com/vesoft-inc/nebula>https://github.com/vesoft-inc/nebula</a></li></ul><h2 id=推荐阅读>推荐阅读</h2><ul><li><a href=https://nebula-graph.io/cn/posts/import-ownthink-knowledge-graph-data-to-nebula-graph/>使用图数据库 Nebula Graph 数据导入快速体验知识图谱 OwnThink</a></li></ul><blockquote class=star-ads><span>你喜欢这篇文章吗? 喜欢的话，给我们点个</span>
<span class="glyphicon glyphicon-star"></span><span>star 吧:</span>
<a href=https://github.com/vesoft-inc/nebula>https://github.com/vesoft-inc/nebula</a></blockquote><ul class=blog-footer><li><img src=/images/tag.png>
<a href=/nebula-website/cn/tags/%e5%ba%94%e7%94%a8%e5%ae%9e%e8%b7%b5>应用实践</a></li><li class="nebula-share st-btn"><img src=/images/share.png>
<span>分享</span><ul class=blog-footer-share-links><li class=st-custom-button data-network=wechat><img alt="wechat-white sharing button" src=https://platform-cdn.sharethis.com/img/wechat-white.svg>
<span class=st-label>微信</span></li><li class=st-custom-button data-network=weibo><img alt="weibo-white sharing button" src=https://platform-cdn.sharethis.com/img/weibo-white.svg>
<span class=st-label>微博</span></li><li class=st-custom-button data-network=sharethis><img alt="sharethis-white sharing button" src=https://platform-cdn.sharethis.com/img/sharethis-white.svg>
<span class=st-label>其他</span></li></ul></li><li onclick="location.href='\/nebula-website\/cn\/posts'"><img src=/images/blog.png>
<a href=/nebula-website/cn/posts>返回到博客页</a></li><li onclick="location.href='https:\/\/nebula-graph.io/cn/posts/index.xml'"><img src=/images/rss.png>
<a onclick="window.open('https:\/\/nebula-graph.io/cn/posts/index.xml')" href>RSS</a></li></ul><div id=discourse-comments></div></section><div class=single-side-bar><div class=tags-block><h3 class="glyphicon glyphicon-tag">标签</h3><ul class=blog-tags><li class=col-md-12><a href=/nebula-website/cn/posts class=active>全部</a></li><li><a href=/nebula-website/cn/tags/release-note>release-note</a></li><li><a href=/nebula-website/cn/tags/%E4%BA%A7%E5%93%81%E5%8A%A8%E6%80%81>产品动态</a></li><li><a href=/nebula-website/cn/tags/%E4%BA%A7%E5%93%81%E8%AE%B2%E8%A7%A3>产品讲解</a></li><li><a href=/nebula-website/cn/tags/%E5%9B%BE%E6%95%B0%E6%8D%AE%E5%BA%93%E7%9F%A5%E8%AF%86>图数据库知识</a></li><li><a href=/nebula-website/cn/tags/%E5%BA%94%E7%94%A8%E5%AE%9E%E8%B7%B5 class=active>应用实践</a></li><li><a href=/nebula-website/cn/tags/%E5%BC%80%E5%8F%91%E6%97%A5%E5%BF%97>开发日志</a></li><li><a href=/nebula-website/cn/tags/%E6%80%A7%E8%83%BD>性能</a></li><li><a href=/nebula-website/cn/tags/%E6%8A%80%E6%9C%AF%E6%BC%94%E8%AE%B2>技术演讲</a></li><li><a href=/nebula-website/cn/tags/%E6%9E%B6%E6%9E%84%E5%89%96%E6%9E%90>架构剖析</a></li><li><a href=/nebula-website/cn/tags/%E6%9F%A5%E8%AF%A2%E8%AF%AD%E8%A8%80>查询语言</a></li><li><a href=/nebula-website/cn/tags/%E7%89%B9%E6%80%A7%E8%AE%B2%E8%A7%A3>特性讲解</a></li><li><a href=/nebula-website/cn/tags/%E7%A4%BE%E5%8C%BA>社区</a></li><li><a href=/nebula-website/cn/tags/%E7%B3%BB%E7%BB%9F%E6%B5%8B%E8%AF%95>系统测试</a></li><li><a href=/nebula-website/cn/tags/%E7%BC%96%E8%AF%91>编译</a></li><li><a href=/nebula-website/cn/tags/%E9%83%A8%E7%BD%B2>部署</a></li></ul></div><div id=blog-carousel class="carousel slide" data-ride=carousel><ol class=carousel-indicators><li data-target=#blog-carousel data-slide-to=0 class=active></li><li data-target=#blog-carousel data-slide-to=1></li></ol><div class=carousel-inner role=listbox><div class="item active" onclick="location.href='\/cn\/posts\/clean-stale-data-with-ttl-in-nebula-graph\/'"><img src=https://nebula-blog.azureedge.net/nebula-blog/TTL01.png alt="图数据库 Nebula Graph TTL 特性" width=220px height=150px><div class=carousel-caption>图数据库 Nebula Graph TTL 特性</div></div><div class=item onclick="location.href='\/cn\/posts\/github-action-automating-project-process\/'"><img src=https://nebula-blog.azureedge.net/nebula-blog/Action01.png alt="使用 Github Action 进行前端自动化发布" width=220px height=150px><div class=carousel-caption>使用 Github Action 进行前端自动化发布</div></div></div><a class="left carousel-control" href=#blog-carousel role=button data-slide=prev><span class="glyphicon glyphicon-chevron-left" aria-hidden=true></span><span class=sr-only>Previous</span></a>
<a class="right carousel-control" href=#blog-carousel role=button data-slide=next><span class="glyphicon glyphicon-chevron-right" aria-hidden=true></span><span class=sr-only>Next</span></a></div><div class=blog-anchors><h3>目录</h3><nav id=TableOfContents><ul><li><a href=#摘要>摘要</a></li><li><a href=#天津案例简述>天津案例简述</a></li><li><a href=#ncov-新冠病的数据分析>nCoV 新冠病的数据分析</a></li><li><a href=#图模型>图模型</a></li><li><a href=#天津案例的建模>天津案例的建模</a><ul><li><a href=#数据录入>数据录入</a></li><li><a href=#病例数据分析>病例数据分析</a></li></ul></li><li><a href=#传播路径可视化展示>传播路径可视化展示</a></li><li><a href=#小结>小结</a></li><li><a href=#参考资料>参考资料</a></li><li><a href=#推荐阅读>推荐阅读</a></li></ul></nav></div><div class=social-share><h3>分享</h3><div class=nebula-share-buttons><div class="st-custom-button st-remove-label" data-network=wechat><img alt="wechat-white sharing button" src=https://platform-cdn.sharethis.com/img/wechat-white.svg></div><div class="st-custom-button st-remove-label" data-network=weibo><img alt="weibo-white sharing button" src=https://platform-cdn.sharethis.com/img/weibo-white.svg></div><div class="st-custom-button st-remove-label" data-network=twitter><img alt="twitter-white sharing button" src=https://platform-cdn.sharethis.com/img/twitter-white.svg></div><div class="st-custom-button st-remove-label" data-network=linkedin><img alt="linkedin-white sharing button" src=https://platform-cdn.sharethis.com/img/linkedin-white.svg></div><div class="st-custom-button st-remove-label" data-network=facebook><img alt="facebook-white sharing button" src=https://platform-cdn.sharethis.com/img/facebook-white.svg></div><div class="st-custom-button st-remove-label" data-network=hackernews><img alt="hackernews-white sharing button" src=https://platform-cdn.sharethis.com/img/hackernews-white.svg></div><div class="st-custom-button st-remove-label" data-network=reddit><img alt="reddit-white sharing button" src=https://platform-cdn.sharethis.com/img/reddit-white.svg></div><div class="st-custom-button st-remove-label" data-network=sharethis><img alt="reddit-white sharing button" src=https://platform-cdn.sharethis.com/img/sharethis-white.svg></div></div></div></div></div><img onclick="location.href='#top'" class=go-ahead src=/images/up.png></div><footer class="container-fluid foot-wrap" name=contact_us><div class=container><p align=center class=statement>Nebula Graph will respect your data privacy per our Privacy Policy</p><div class=row><div class="row-content col-lg-4 col-sm-4 col-xs-4"><h3>Community</h3><ul><li><img src=/img/github.png>
<a href=https://github.com/vesoft-inc/nebula target=_blank>GitHub</a></li><li><img src=/img/forum.png>
<a href=https://discuss.nebula-graph.io/ target=_blank>论坛</a></li><li><img src=/img/slack.png>
<a href=https://join.slack.com/t/nebulagraph/shared_invite/enQtNjIzMjQ5MzE2OTQ2LTM0MjY0MWFlODg3ZTNjMjg3YWU5ZGY2NDM5MDhmOGU2OWI5ZWZjZDUwNTExMGIxZTk2ZmQxY2Q2MzM1OWJhMmY# target=_blank>Slack</a></li></ul></div><div class="row-content col-lg-4 col-sm-4 col-xs-4"><h3>Follow Us</h3><ul><li><img src=/img/twitter.png>
<a href=https://twitter.com/NebulaGraph title=Twitter data-toggle=modal target=_blank data-target>Twitter</a></li><li><img src=/img/weibo.png>
<a href=https://weibo.com/nebulagraph title=微博 data-toggle=modal target=_blank data-target>微博</a></li><li><img src=/img/linkedin.png>
<a href=https://www.linkedin.com/company/vesoft-nebula-graph/ title=LinkedIn data-toggle=modal target=_blank data-target>LinkedIn</a></li><li><img src=/img/youtube.png>
<a href=https://www.youtube.com/channel/UC73V8q795eSEMxDX4Pvdwmw title=YouTube data-toggle=modal target=_blank data-target>YouTube</a></li><li><img src=/img/facebook.png>
<a href=https://www.facebook.com/NebulaGraph/ title=FaceBook data-toggle=modal target=_blank data-target>FaceBook</a></li><li><img src=/img/gongzhonghao.png>
<a href title=微信公众号 data-toggle=modal target=_blank data-target=#myGongzhonghaoModal>微信公众号</a></li></ul></div><div class="contactus row-content col-lg-4 col-sm-4 col-xs-4"><h3>Contact Us</h3><ul><li><img src=/img/iphone.png>
<a href data-toggle=modal target=_blank data-target>(+86) 0571-28120658</a></li><li><img src=/img/email.png>
<a href=mailto:info@vesoft.com data-toggle=modal target=_blank data-target>info@vesoft.com</a></li><li><img src=/img/weixin.png>
<a href data-toggle=modal target=_blank data-target=#myModal>微信个人助理</a></li></ul></div></div></div><p align=left style=font-size:16px><img src=/images/VEsoft.png style=margin-right:10px> Copyright &copy;2020 VESoft Inc</p><div class="modal fade" id=myGongzhonghaoModal tabindex=-1 role=dialog aria-labelledby=myModalLabel aria-hidden=true><div class=modal-dialog><div class=modal-content><div class="modal-body wechat"><img src=/images/gonggonghaoCODE.jpg></div><div class=modal-footer><button type=button class="btn btn-default" data-dismiss=modal>close</button></div></div></div></div><div class="modal fade" id=myModal tabindex=-1 role=dialog aria-labelledby=myModalLabel aria-hidden=true><div class=modal-dialog><div class=modal-content><div class="modal-body wechat"><img src=/images/wechat.png></div><div class=modal-footer><button type=button class="btn btn-default" data-dismiss=modal>close</button></div></div></div></div></footer></main><div id=J-star-popup class=nebula-star-popup></div><script src=/nebula-website/js/jquery.js></script><script src=/nebula-website/js/bootstrap.min.js></script><script src=/nebula-website/js/jquery.easing.min.js></script><script src=/nebula-website/js/jquery.fittext.js></script><script src=/nebula-website/js/wow.min.js></script><script type=text/javascript src="https://platform-api.sharethis.com/js/sharethis.js#property=5e7c2cc315c7990012ae38bc&product=inline-share-buttons" async></script><script src=/nebula-website/js/creative.js></script><script async defer src=https://buttons.github.io/buttons.js></script><script src=/nebula-website/js/init.js></script><script type=text/javascript>DiscourseEmbed={discourseUrl:'https://discuss.nebula-graph.io/',discourseEmbedUrl:"\/nebula-website\/cn\/posts\/detect-corona-virus-spreading-with-graph-database\/"};(function(){var d=document.createElement('script');d.type='text/javascript';d.async=true;d.src=DiscourseEmbed.discourseUrl+'javascripts/embed.js';(document.getElementsByTagName('head')[0]||document.getElementsByTagName('body')[0]).appendChild(d);})();</script></body></html>