<!doctype html><html lang=en-us><head><meta charset=utf-8><meta http-equiv=x-ua-compatible content="IE=edge"><meta name=viewport content="width=device-width,initial-scale=1"><meta name=author content="Nebula Graph"><meta name=twitter:card content="summary_large_image"><meta name=twitter:site content="@NebulaGraph"><meta name=twitter:creator content="@NebulaGraph"><meta name=twitter:domain content="nebula-graph.io"><meta name=twitter:title content="一文了解各大图数据库查询语言 | 操作入门篇"><meta property="twitter:title" content="一文了解各大图数据库查询语言 | 操作入门篇"><meta name=twitter:description content="介于市面上没有统一的图查询语言标准，在本文中我们选取市面上主流的几款图查询语言来分析一波用法"><meta name=og:description content="介于市面上没有统一的图查询语言标准，在本文中我们选取市面上主流的几款图查询语言来分析一波用法"><meta name=twitter:image content="/nebula-website/cn/posts/graph-query-language-comparison-cypher-gremlin-ngql/ngql_hu7ca0ad005810143b0a14319d9b893d04_61815_600x0_resize_box_2.png"><meta name=og:image content="/nebula-website/cn/posts/graph-query-language-comparison-cypher-gremlin-ngql/ngql_hu7ca0ad005810143b0a14319d9b893d04_61815_600x0_resize_box_2.png"><meta name=description content="介于市面上没有统一的图查询语言标准，在本文中我们选取市面上主流的几款图查询语言来分析一波用法"><meta name=generator content="Hugo 0.65.3"><title>一文了解各大图数据库查询语言 | 操作入门篇</title><link rel="shortcut icon" href=/nebula-website/favicon.ico><link rel=stylesheet href=/nebula-website/css/bootstrap.min.css type=text/css><link href="//fonts.googleapis.com/css?family=Open+Sans:300italic,400italic,600italic,700italic,800italic,400,300,600,700,800" rel=stylesheet type=text/css><link href="//fonts.googleapis.com/css?family=Merriweather:400,300,300italic,400italic,700,700italic,900,900italic" rel=stylesheet type=text/css><link rel=stylesheet href=/nebula-website/font-awesome/css/font-awesome.min.css type=text/css><link rel=stylesheet href=/nebula-website/css/creative.css type=text/css><link rel=stylesheet href=/nebula-website/css/modals.css type=text/css><link rel=stylesheet href=/nebula-website/css/animate.min.css type=text/css><link rel=stylesheet href=/nebula-website/css/custom/index.css type=text/css><!--[if lt IE 9]><script src=https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js></script><script src=https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js></script><![endif]--><script src=/nebula-website/js/jquery.js></script><script async src="https://www.googletagmanager.com/gtag/js?id=UA-60523578-5"></script><script>window.dataLayer=window.dataLayer||[];function gtag(){dataLayer.push(arguments);}
gtag('js',new Date());gtag('config','UA-60523578-5');</script></head><body id=page-top><nav id=mainNav class="navbar navbar-default navbar-fixed-top"><div class=container-fluid><div class=navbar-header><div class=github-star><a class=github-button href=https://github.com/vesoft-inc/nebula data-icon=octicon-star data-show-count=true aria-label="Star vesoft-inc/nebula on GitHub">Star</a></div><button type=button class="navbar-toggle collapsed" data-toggle=collapse data-target=#bs-example-navbar-collapse-1>
<span class=sr-only>Toggle navigation</span>
<span class=icon-bar></span><span class=icon-bar></span><span class=icon-bar></span></button>
<a class="navbar-brand page-scroll" href=/></a></div><div class="collapse navbar-collapse" id=bs-example-navbar-collapse-1><ul class="nav navbar-nav" id=nav><li class=github-star id=github-star><a class=github-button href=https://github.com/vesoft-inc/nebula data-size=large data-show-count=true aria-label="Star vesoft-inc/nebula on GitHub">Star</a></li><li><a href=https://docs.nebula-graph.io/ target=_blank>文档</a></li><li class=active><a href=/cn/posts target>博客</a></li><li><a href=https://discuss.nebula-graph.io/ target=_blank>论坛</a></li><li><a href=#contact_us target onclick=contactUsClick()>联系我们</a></li><li class="dropdown navbar-right"><a class=dropdown-toggle data-toggle=dropdown href=# role=button aria-haspopup=true aria-expanded=false><img src=/images/language120x120.png>
<span class=caret></span></a><ul class=dropdown-menu><li class=nav-item><a class=dropdown-item href=/en target>English</a></li><li class=nav-item><a class=dropdown-item href=/cn target>中文</a></li></ul></li><li id=navbar-right><a href=https://github.com/vesoft-inc/nebula-web-docker target=_blank>Nebula Studio</a></li></ul></div></div></nav><script>function contactUsClick(){$('html,body').animate({scrollTop:document.documentElement.scrollHeight},800)
return false;}</script><main id=top class=blog-detail><div class=wrapper><div class=inner><section class=blog-content><h1>一文了解各大图数据库查询语言 | 操作入门篇</h1><div class=blog-metas><div class=meta><img src=/images/writer.png width=16px height=16px>
<span>清蒸, 张莹, Jude</span></div><div class=meta><img src=/images/calendar.png width=16px height=16px>
<span>2020-03-03</span></div><div class="tags meta"><img src=/images/tag.png width=16px height=16px>
<a href=/nebula-website/cn//tags/%E5%9B%BE%E6%95%B0%E6%8D%AE%E5%BA%93%E7%9F%A5%E8%AF%86>图数据库知识</a><a href=/nebula-website/cn//tags/%E6%9F%A5%E8%AF%A2%E8%AF%AD%E8%A8%80>查询语言</a></div></div><p>文章的开头我们先来看下什么是图数据库，根据维基百科的定义：<strong>图数据库是使用图结构进行语义查询的数据库，它使用节点、边和属性来表示和存储数据</strong>。</p><p>虽然和关系型数据库存储的结构不同（关系型数据库为表结构，图数据库为图结构），但不计各自的性能问题，关系型数据库可以通过递归查询或者组合其他 SQL 语句（Join）完成图查询语言查询节点关系操作。得益于 1987 年 SQL 成为国际标准化组织（ISO）标准，关系型数据库行业得到了很好的发展。同 60、70 年代的关系型数据库类似，图数据库这个领域的查询语言目前也没有统一标准，虽然 19 年 9 月经过国际 SQL 标准委员会投票表决，决定将图查询语言（Graph Query Language）纳为一种新的数据库查询语言，但 GQL 的制定仍需要一段时间。</p><p><img src=https://nebula-blog.azureedge.net/nebula-blog/GraphQueryLanguage01.png alt=image></p><p>介于市面上没有统一的图查询语言标准，在本文中我们选取市面上主流的几款图查询语言来分析一波用法，由于篇幅原因本文旨在简单介绍图查询语言和常规用法，更详细的内容将在进阶篇中讲述。</p><h2 id=图查询语言介绍>图查询语言·介绍</h2><p><img src=https://nebula-blog.azureedge.net/nebula-blog/GraphQueryLanguage02.png alt=image></p><h3 id=图查询语言-gremlin>图查询语言 Gremlin</h3><p><a href=https://tinkerpop.apache.org/gremlin.html>Gremlin</a> 是 Apache ThinkerPop 框架下的图遍历语言。Gremlin 可以是<strong>声明性</strong>的也可以是<strong>命令性</strong>的。虽然 Gremlin 是基于 Groovy 的，但具有许多语言变体，允许开发人员以 Java、JavaScript、Python、Scala、Clojure 和 Groovy 等许多现代编程语言<strong>原生编写 Gremlin 查询</strong>。</p><p>支持图数据库：Janus Graph、InfiniteGraph、Cosmos DB、DataStax Enterprise(5.0+) 、Amazon Neptune</p><h3 id=图查询语言-cypher>图查询语言 Cypher</h3><p>Cypher 是一个描述性的图形查询语言，允许不必编写图形结构的遍历代码对图形存储有表现力和效率的查询，和 SQL 很相似，Cypher 语言的关键字不区分大小写，但是属性值，标签，关系类型和变量是区分大小写的。</p><p>支持图数据库： Neo4j、RedisGraph</p><h3 id=图查询语言-ngql>图查询语言 nGQL</h3><p><a href=https://github.com/vesoft-inc/nebula/blob/master/docs/manual-CN/1.overview/1.concepts/2.nGQL-overview.md>nGQL</a> 是一种类 SQL 的声明型的文本查询语言，nGQL 同样是关键词大小写不敏感的查询语言，目前支持模式匹配、聚合运算、图计算，可无嵌入组合语句。</p><p>支持图数据库：Nebula Graph</p><h2 id=图查询语言术语篇>图查询语言·术语篇</h2><p>在比较这 3 个图查询语言之前，我们先来看看他们各自的术语，如果你翻阅他们的文档会经常见到下面这些“关键字”，在这里我们不讲用法，只看这些图数据库常用概念在这 3 个图数据库文档中的叫法。</p><table><thead><tr><th>术语</th><th>Gremlin</th><th>Cypher</th><th>nGQL</th></tr></thead><tbody><tr><td>点</td><td>Vertex</td><td>Node</td><td>Vertex</td></tr><tr><td>边</td><td>Edge</td><td>Relationship</td><td>Edge</td></tr><tr><td>点类型</td><td>Label</td><td>Label</td><td>Tag</td></tr><tr><td>边类型</td><td>label</td><td>RelationshipType</td><td>edge type</td></tr><tr><td>点 ID</td><td>vid</td><td>id(n)</td><td>vid</td></tr><tr><td>边 ID</td><td>eid</td><td>id(r)</td><td>无</td></tr><tr><td>插入</td><td>add</td><td>create</td><td>insert</td></tr><tr><td>删除</td><td>drop</td><td>delete</td><td>delete / drop</td></tr><tr><td>更新属性</td><td>setProperty</td><td>set</td><td>update</td></tr></tbody></table><p>我们可以看到大体上对点和边的叫法类似，只不过 Cypher 中直接使用了 Relationship 关系一词代表边。其他的术语基本都非常直观。</p><h2 id=图查询语言语法篇>图查询语言·语法篇</h2><p>了解过 Gremlin、Cypher、nGQL 中常见的术语之后，我们来看看使用这 3 个图查询语言过程中会需要了解的常规语法。</p><h3 id=图>图</h3><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-shell data-lang=shell><span style=color:#75715e># Gremlin 创建图</span>
g <span style=color:#f92672>=</span> TinkerGraph.open<span style=color:#f92672>()</span>.traversal<span style=color:#f92672>()</span>

<span style=color:#75715e># nGQL 创建图空间</span>
CREATE SPACE gods
</code></pre></div><h3 id=点>点</h3><p>图结构由点和边组成，一条边连接两个点。在 Gremlin 和 nGQL 中称之为 Vertex，Cypher 则称之为 Node。如何在图数据库中新建一个点呢？可以参考下面的语法</p><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-shell data-lang=shell><span style=color:#75715e># Gremlin 创建/插入点</span>
g.addV<span style=color:#f92672>(</span>vertexLabel<span style=color:#f92672>)</span>.property<span style=color:#f92672>()</span>

<span style=color:#75715e># Cypher 创建点</span>
CREATE <span style=color:#f92672>(</span>:nodeLabel <span style=color:#f92672>{</span>property<span style=color:#f92672>})</span>

<span style=color:#75715e># nGQL 创建/插入点</span>
INSERT VERTEX tagName <span style=color:#f92672>(</span>propNameList<span style=color:#f92672>)</span> VALUES vid:<span style=color:#f92672>(</span>tagKey propValue<span style=color:#f92672>)</span>
</code></pre></div><h4 id=点类型>点类型</h4><p>点允许有对应的类型，在 Gremlin 和 Cypher 叫 <code>label</code> ，在 nGQL 中为 <code>tag</code> 。点类型可对应有多种属性（Property），例如 _Person _可以有 <em>name</em>、_age _等属性。</p><p><img src=https://nebula-blog.azureedge.net/nebula-blog/GraphQueryLanguage03.png alt=image></p><h5 id=创建点类型>创建点类型</h5><p>点类型相关的语法示例如下：</p><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-shell data-lang=shell><span style=color:#75715e># Gremlin 创建点类型</span>
g.addV<span style=color:#f92672>(</span>vertexLabel<span style=color:#f92672>)</span>.property<span style=color:#f92672>()</span>

<span style=color:#75715e># nGQL 创建点类型</span>
CREATE tagName<span style=color:#f92672>(</span>PropNameList<span style=color:#f92672>)</span>
</code></pre></div><p>这里说明下，无论在 Gremlin 和 nGQL 中存在类似 <code>IF NOT EXISTS</code>  用法，即：如果不存在则创建，存在则直接返回。</p><h5 id=查看点类型>查看点类型</h5><p>创建好点之后如何查看点类型呢，可以参考以下方式。 </p><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-shell data-lang=shell><span style=color:#75715e># Gremlin 查看（获取）点类型</span>
g.V<span style=color:#f92672>()</span>.label<span style=color:#f92672>()</span>.dedup<span style=color:#f92672>()</span>;

<span style=color:#75715e># Cypher 查看点类型方法 1</span>
MATCH <span style=color:#f92672>(</span>n<span style=color:#f92672>)</span> 
RETURN DISTINCT labels<span style=color:#f92672>(</span>n<span style=color:#f92672>)</span>
<span style=color:#75715e># Cypher 查看点类型方法 2</span>
CALL db.labels<span style=color:#f92672>()</span>;

<span style=color:#75715e># nGQL 查看点类型</span>
SHOW TAGS
</code></pre></div><h4 id=点的-crud>点的 CRUD</h4><p>上面简单介绍了点、点类型，下面进入数据库基本 DML——CRUD，在上文介绍点时顺便介绍了点的创建和插入，这里说下如何插入特定类型的点，和点的获取、删除和更新。</p><h5 id=插入特定类型点>插入特定类型点</h5><p>和插入点的操作类似，只不过需要指定某种点类型。语法参考：</p><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-shell data-lang=shell><span style=color:#75715e># Gremlin 插入特定类型点</span>
g.addV<span style=color:#f92672>(</span>String vertexLabel<span style=color:#f92672>)</span>.property<span style=color:#f92672>()</span>

<span style=color:#75715e># Cypher 插入特定类型点</span>
CREATE <span style=color:#f92672>(</span>node:label<span style=color:#f92672>)</span> 

<span style=color:#75715e># nGQL 插入特定类型点</span>
INSERT VERTEX &lt;tag_name&gt; <span style=color:#f92672>(</span>prop_name_list<span style=color:#f92672>)</span> VALUES &lt;vid&gt;:<span style=color:#f92672>(</span>prop_value_list<span style=color:#f92672>)</span>
</code></pre></div><h5 id=查看点>查看点</h5><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-shell data-lang=shell><span style=color:#75715e># Gremlin 查看点</span>
g.V<span style=color:#f92672>(</span>&lt;vid&gt;<span style=color:#f92672>)</span>

<span style=color:#75715e># Cypher 查看点</span>
MATCH <span style=color:#f92672>(</span>n<span style=color:#f92672>)</span> 
WHERE condition
RETURN properties<span style=color:#f92672>(</span>n<span style=color:#f92672>)</span>

<span style=color:#75715e># nGQL 查看点</span>
FETCH PROP ON &lt;tag_name&gt; &lt;vid&gt;
</code></pre></div><h5 id=删除点>删除点</h5><p>术语篇中提过 nGQL 中删除操作对应单词有 <code>Delete</code> 和 <code>Drop</code> ，在 nGQL 中 Delete 一般用于点边，Drop 用于 Schema 删除，这点和 SQL 的设计思路是一样的。</p><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-shell data-lang=shell><span style=color:#75715e># Gremlin 删除点</span>
g.V<span style=color:#f92672>(</span>&lt;vid&gt;<span style=color:#f92672>)</span>.drop<span style=color:#f92672>()</span>

<span style=color:#75715e># Cypher 删除点</span>
MATCH <span style=color:#f92672>(</span>node:label<span style=color:#f92672>)</span> 
DETACH DELETE node

<span style=color:#75715e># nGQL 删除点</span>
DELETE VERTEX &lt;vid&gt;
</code></pre></div><h5 id=更新点>更新点</h5><p>用数据库的小伙伴都知道数据的常态是数据变更，来瞅瞅这 3 个图查询是使用什么语法来更新点数据的吧</p><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-shell data-lang=shell><span style=color:#75715e># Gremlin 更新点</span>
g.V<span style=color:#f92672>(</span>&lt;vid&gt;<span style=color:#f92672>)</span>.property<span style=color:#f92672>()</span>

<span style=color:#75715e># Cypher 更新点</span>
SET n.prop <span style=color:#f92672>=</span> V

<span style=color:#75715e># nGQL 更新点</span>
UPDATE VERTEX &lt;vid&gt; SET &lt;update_columns&gt;
</code></pre></div><p>可以看到 Cypher 和 nGQL 都使用 SET 关键词来设置点对应的类型值，只不过 nGQL 中多了 UPDATE 关键词来标识操作，Gremlin 的操作和上文提到的查看点类似，只不过增加了变更 property 值操作。</p><h3 id=边>边</h3><p>在 Gremlin 和 nGQL 称呼边为 Edge，而 Cypher 称之为 Relationship。下面进入到边相关的语法内容</p><h4 id=边类型>边类型 </h4><p>和点一样，边也可以有对应的类型</p><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-shell data-lang=shell><span style=color:#75715e># Gremlin 创建边类型</span>
g.edgeLabel<span style=color:#f92672>()</span>

<span style=color:#75715e># nGQL 创建边类型</span>
CREATE EDGE edgeTypeName<span style=color:#f92672>(</span>propNameList<span style=color:#f92672>)</span>
</code></pre></div><h4 id=边的-crud>边的 CRUD</h4><p>说完边类型应该进入到边的常规操作部分了</p><h5 id=插入指定边类型的边>插入指定边类型的边</h5><p>可以看到和点的使用语法类似，只不过在 Cypher 和 nGQL 中分别使用 <code>-[]-></code> 和 <code>-></code> 来表示关系，而 Gremlin 则用 <code>to()</code> 关键词来标识指向关系，在使用这 3 种图查询语言的图数据库中的边均为有向边，下图左边为有向边，右边为无向边。</p><p><img src=https://nebula-blog.azureedge.net/nebula-blog/GraphQueryLanguage04.png alt=image></p><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-shell data-lang=shell><span style=color:#75715e># Gremlin 插入指定边类型的边</span>
g.addE<span style=color:#f92672>(</span>String edgeLabel<span style=color:#f92672>)</span>.from<span style=color:#f92672>(</span>v1<span style=color:#f92672>)</span>.to<span style=color:#f92672>(</span>v2<span style=color:#f92672>)</span>.property<span style=color:#f92672>()</span>

<span style=color:#75715e># Cypher 插入指定边类型的边</span>
CREATE <span style=color:#f92672>(</span>&lt;node1-name&gt;:&lt;label1-name&gt;<span style=color:#f92672>)</span>-
  <span style=color:#f92672>[(</span>&lt;relationship-name&gt;:&lt;relationship-label-name&gt;<span style=color:#f92672>)]</span>
  -&gt;<span style=color:#f92672>(</span>&lt;node2-name&gt;:&lt;label2-name&gt;<span style=color:#f92672>)</span>

<span style=color:#75715e># nGQL 插入指定边类型的边</span>
INSERT EDGE &lt;edge_name&gt; <span style=color:#f92672>(</span>&lt;prop_name_list&gt;<span style=color:#f92672>)</span> VALUES &lt;src_vid&gt; -&gt; &lt;dst_vid&gt;: <span style=color:#ae81ff>\
</span><span style=color:#ae81ff></span><span style=color:#f92672>(</span>&lt;prop_value_list&gt;<span style=color:#f92672>)</span>
</code></pre></div><h5 id=删除边>删除边</h5><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-shell data-lang=shell><span style=color:#75715e># Gremlin 删除边</span>
g.E<span style=color:#f92672>(</span>&lt;eid&gt;<span style=color:#f92672>)</span>.drop<span style=color:#f92672>()</span>

<span style=color:#75715e># Cypher 删除边</span>
MATCH <span style=color:#f92672>(</span>&lt;node1-name&gt;:&lt;label1-name&gt;<span style=color:#f92672>)</span>-<span style=color:#f92672>[</span>r:relationship-label-name<span style=color:#f92672>]</span>-&gt;<span style=color:#f92672>()</span>
DELETE r

<span style=color:#75715e># nGQL 删除边</span>
DELETE EDGE &lt;edge_type&gt; &lt;src_vid&gt; -&gt; &lt;dst_vid&gt;
</code></pre></div><h5 id=查看指定边>查看指定边</h5><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-shell data-lang=shell><span style=color:#75715e># Gremlin 查看指定边</span>
g.E<span style=color:#f92672>(</span>&lt;eid&gt;<span style=color:#f92672>)</span>

<span style=color:#75715e># Cypher 查看指定边</span>
MATCH <span style=color:#f92672>(</span>n<span style=color:#f92672>)</span>-<span style=color:#f92672>[</span>r:label<span style=color:#f92672>]</span>-&gt;<span style=color:#f92672>()</span>
WHERE condition
RETURN properties<span style=color:#f92672>(</span>r<span style=color:#f92672>)</span>

<span style=color:#75715e># nGQL 查看指定边</span>
FETCH PROP ON &lt;edge_name&gt; &lt;src_vid&gt; -&gt; &lt;dst_vid&gt;
</code></pre></div><h3 id=其他操作>其他操作</h3><p>除了常规的点、边 CRUD 外，我们可以简单看看这 3 种图查询语言的组合查询。</p><h4 id=指定点查指定边>指定点查指定边</h4><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-shell data-lang=shell><span style=color:#75715e># Gremlin 指定点查指定边</span>
g.V<span style=color:#f92672>(</span>&lt;vid&gt;<span style=color:#f92672>)</span>.outE<span style=color:#f92672>(</span>&lt;edge&gt;<span style=color:#f92672>)</span>

<span style=color:#75715e># Cypher 指定点查指定边</span>
Match <span style=color:#f92672>(</span>n<span style=color:#f92672>)</span>-&gt;<span style=color:#f92672>[</span>r:label<span style=color:#f92672>]</span>-&gt;<span style=color:#f92672>[]</span>
WHERE id<span style=color:#f92672>(</span>n<span style=color:#f92672>)</span> <span style=color:#f92672>=</span> vid
RETURN r

<span style=color:#75715e># nGQL 指定点查指定边</span>
GO FROM &lt;vid&gt; OVER &lt;edge&gt;
</code></pre></div><h4 id=沿指定点反向查询指定边>沿指定点反向查询指定边</h4><p>在反向查询中，Gremlin 使用了 in 来表示反向关系，而 Cypher 则更直观的将指向箭头反向变成 <code>&lt;-</code> 来表示反向关系，nGQL 则用关键词 <code>REVERSELY</code> 来标识反向关系。</p><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-shell data-lang=shell><span style=color:#75715e># Gremlin 沿指定点反向查询指定边</span>
g.V<span style=color:#f92672>(</span>&lt;vid&gt;<span style=color:#f92672>)</span>.inE<span style=color:#f92672>(</span>&lt;edge&gt;<span style=color:#f92672>)</span>

<span style=color:#75715e># Cypher 沿指定点反向查询指定边</span>
MATCH <span style=color:#f92672>(</span>n<span style=color:#f92672>)</span>&lt;-<span style=color:#f92672>[</span>r:label<span style=color:#f92672>]</span>-<span style=color:#f92672>()</span>

<span style=color:#75715e># nGQL 沿指定点反向查询指定边</span>
GO FROM &lt;vid&gt; OVER &lt;edge&gt; REVERSELY
</code></pre></div><h4 id=无向遍历>无向遍历</h4><p>如果在图中，边的方向不重要（正向、反向都可以），那 Gremlin 使用 <code>both()</code> ，Cypher 使用 <code>-[]-</code> ，nGQL使用关键词 <code>BIDIRECT</code> 。</p><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-shell data-lang=shell><span style=color:#75715e># Traverse edges with specified vertices Gremlin</span>
g.V<span style=color:#f92672>(</span>&lt;vid&gt;<span style=color:#f92672>)</span>.bothE<span style=color:#f92672>(</span>&lt;edge&gt;<span style=color:#f92672>)</span>

<span style=color:#75715e># Traverse edges with specified vertices Cypher</span>
MATCH <span style=color:#f92672>(</span>n<span style=color:#f92672>)</span>-<span style=color:#f92672>[</span>r:label<span style=color:#f92672>]</span>-<span style=color:#f92672>()</span>

<span style=color:#75715e># Traverse edges with specified vertices nGQL</span>
GO FROM &lt;vid&gt;  OVER &lt;edge&gt; BIDIRECT
</code></pre></div><h4 id=沿指定点查询指定边-n-跳>沿指定点查询指定边 N 跳</h4><p>Gremlin 和 nGQL 分别用 times 和 step 来表示 N 跳关系，而 Cypher 用 <code>relationship*1..N</code> 来表示 N 跳关系。</p><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-shell data-lang=shell><span style=color:#75715e># Gremlin 沿指定点查询指定边 N 跳</span>
g.V<span style=color:#f92672>(</span>&lt;vid&gt;<span style=color:#f92672>)</span>.repeat<span style=color:#f92672>(</span>out<span style=color:#f92672>(</span>&lt;edge&gt;<span style=color:#f92672>))</span>.times<span style=color:#f92672>(</span>N<span style=color:#f92672>)</span>

<span style=color:#75715e># Cypher 沿指定点查询指定边 N 跳</span>
MATCH <span style=color:#f92672>(</span>n<span style=color:#f92672>)</span>-<span style=color:#f92672>[</span>r:label*N<span style=color:#f92672>]</span>-&gt;<span style=color:#f92672>()</span>
WHERE condition
RETURN r

<span style=color:#75715e># nGQL 沿指定点查询指定边 N 跳</span>
GO N STEPS FROM &lt;vid&gt; OVER &lt;edge&gt;
</code></pre></div><h4 id=返回指定两点路径>返回指定两点路径</h4><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-shell data-lang=shell><span style=color:#75715e># Gremlin 返回指定两点路径</span>
g.V<span style=color:#f92672>(</span>&lt;vid&gt;<span style=color:#f92672>)</span>.repeat<span style=color:#f92672>(</span>out<span style=color:#f92672>())</span>.until<span style=color:#f92672>(</span>&lt;vid&gt;<span style=color:#f92672>)</span>.path<span style=color:#f92672>()</span>

<span style=color:#75715e># Cypher 返回指定两点路径</span>
MATCH p <span style=color:#f92672>=(</span>a<span style=color:#f92672>)</span>-<span style=color:#f92672>[</span>.*<span style=color:#f92672>]</span>-&gt;<span style=color:#f92672>(</span>b<span style=color:#f92672>)</span>
WHERE condition
RETURN p

<span style=color:#75715e># nGQL 返回指定两点路径</span>
FIND ALL PATH FROM &lt;vid&gt; TO &lt;vid&gt; OVER *
</code></pre></div><h2 id=图查询语言实操篇>图查询语言·实操篇</h2><p>说了一通语法之后，是时候展示真正的技术了——来个具体一点的例子。</p><h3 id=示例图the-graphs-of-gods>示例图：The Graphs of Gods</h3><p>实操示例使用了 <a href=https://janusgraph.org/>Janus Graph</a> 的示例图 <a href=https://docs.janusgraph.org/#getting-started><em>The Graphs of Gods</em></a>。该图结构如下图所示，描述了罗马万神话中诸神关系。</p><p><img src=https://nebula-blog.azureedge.net/nebula-blog/GraphQueryLanguage05.png alt=image></p><h3 id=插入数据>插入数据</h3><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-bash data-lang=bash><span style=color:#75715e># 插入点</span>
<span style=color:#75715e>## nGQL</span>
nebula&gt; INSERT VERTEX character<span style=color:#f92672>(</span>name, age, type<span style=color:#f92672>)</span> VALUES hash<span style=color:#f92672>(</span><span style=color:#e6db74>&#34;saturn&#34;</span><span style=color:#f92672>)</span>:<span style=color:#f92672>(</span><span style=color:#e6db74>&#34;saturn&#34;</span>, 10000, <span style=color:#e6db74>&#34;titan&#34;</span><span style=color:#f92672>)</span>, hash<span style=color:#f92672>(</span><span style=color:#e6db74>&#34;jupiter&#34;</span><span style=color:#f92672>)</span>:<span style=color:#f92672>(</span><span style=color:#e6db74>&#34;jupiter&#34;</span>, 5000, <span style=color:#e6db74>&#34;god&#34;</span><span style=color:#f92672>)</span>;
<span style=color:#75715e>## Gremlin</span>
gremlin&gt; saturn <span style=color:#f92672>=</span> g.addV<span style=color:#f92672>(</span><span style=color:#e6db74>&#34;character&#34;</span><span style=color:#f92672>)</span>.property<span style=color:#f92672>(</span>T.id, 1<span style=color:#f92672>)</span>.property<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;name&#39;</span>, <span style=color:#e6db74>&#39;saturn&#39;</span><span style=color:#f92672>)</span>.property<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;age&#39;</span>, 10000<span style=color:#f92672>)</span>.property<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;type&#39;</span>, <span style=color:#e6db74>&#39;titan&#39;</span><span style=color:#f92672>)</span>.next<span style=color:#f92672>()</span>;
<span style=color:#f92672>==</span>&gt;v<span style=color:#f92672>[</span>1<span style=color:#f92672>]</span>
gremlin&gt; jupiter <span style=color:#f92672>=</span> g.addV<span style=color:#f92672>(</span><span style=color:#e6db74>&#34;character&#34;</span><span style=color:#f92672>)</span>.property<span style=color:#f92672>(</span>T.id, 2<span style=color:#f92672>)</span>.property<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;name&#39;</span>, <span style=color:#e6db74>&#39;jupiter&#39;</span><span style=color:#f92672>)</span>.property<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;age&#39;</span>, 5000<span style=color:#f92672>)</span>.property<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;type&#39;</span>, <span style=color:#e6db74>&#39;god&#39;</span><span style=color:#f92672>)</span>.next<span style=color:#f92672>()</span>;
<span style=color:#f92672>==</span>&gt;v<span style=color:#f92672>[</span>2<span style=color:#f92672>]</span>
gremlin&gt; prometheus <span style=color:#f92672>=</span> g.addV<span style=color:#f92672>(</span><span style=color:#e6db74>&#34;character&#34;</span><span style=color:#f92672>)</span>.property<span style=color:#f92672>(</span>T.id, 31<span style=color:#f92672>)</span>.property<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;name&#39;</span>,  <span style=color:#e6db74>&#39;prometheus&#39;</span><span style=color:#f92672>)</span>.property<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;age&#39;</span>, 1000<span style=color:#f92672>)</span>.property<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;type&#39;</span>, <span style=color:#e6db74>&#39;god&#39;</span><span style=color:#f92672>)</span>.next<span style=color:#f92672>()</span>;
<span style=color:#f92672>==</span>&gt;v<span style=color:#f92672>[</span>31<span style=color:#f92672>]</span>
gremlin&gt; jesus <span style=color:#f92672>=</span> g.addV<span style=color:#f92672>(</span><span style=color:#e6db74>&#34;character&#34;</span><span style=color:#f92672>)</span>.property<span style=color:#f92672>(</span>T.id, 32<span style=color:#f92672>)</span>.property<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;name&#39;</span>,  <span style=color:#e6db74>&#39;jesus&#39;</span><span style=color:#f92672>)</span>.property<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;age&#39;</span>, 5000<span style=color:#f92672>)</span>.property<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;type&#39;</span>, <span style=color:#e6db74>&#39;god&#39;</span><span style=color:#f92672>)</span>.next<span style=color:#f92672>()</span>;
<span style=color:#f92672>==</span>&gt;v<span style=color:#f92672>[</span>32<span style=color:#f92672>]</span>
<span style=color:#75715e>## Cypher</span>
cypher&gt; CREATE <span style=color:#f92672>(</span>src:character <span style=color:#f92672>{</span>name:<span style=color:#e6db74>&#34;saturn&#34;</span>, age: 10000, type:<span style=color:#e6db74>&#34;titan&#34;</span><span style=color:#f92672>})</span>
cypher&gt; CREATE <span style=color:#f92672>(</span>dst:character <span style=color:#f92672>{</span>name:<span style=color:#e6db74>&#34;jupiter&#34;</span>, age: 5000, type:<span style=color:#e6db74>&#34;god&#34;</span><span style=color:#f92672>})</span>

<span style=color:#75715e># 插入边</span>
<span style=color:#75715e>## nGQL</span>
nebula&gt; INSERT EDGE father<span style=color:#f92672>()</span> VALUES hash<span style=color:#f92672>(</span><span style=color:#e6db74>&#34;jupiter&#34;</span><span style=color:#f92672>)</span>-&gt;hash<span style=color:#f92672>(</span><span style=color:#e6db74>&#34;saturn&#34;</span><span style=color:#f92672>)</span>:<span style=color:#f92672>()</span>;
<span style=color:#75715e>## Gremlin</span>
gremlin&gt; g.addE<span style=color:#f92672>(</span><span style=color:#e6db74>&#34;father&#34;</span><span style=color:#f92672>)</span>.from<span style=color:#f92672>(</span>jupiter<span style=color:#f92672>)</span>.to<span style=color:#f92672>(</span>saturn<span style=color:#f92672>)</span>.property<span style=color:#f92672>(</span>T.id, 13<span style=color:#f92672>)</span>;
<span style=color:#f92672>==</span>&gt;e<span style=color:#f92672>[</span>13<span style=color:#f92672>][</span>2-father-&gt;1<span style=color:#f92672>]</span>
<span style=color:#75715e>## Cypher</span>
cypher&gt; CREATE <span style=color:#f92672>(</span>src<span style=color:#f92672>)</span>-<span style=color:#f92672>[</span>rel:father<span style=color:#f92672>]</span>-&gt;<span style=color:#f92672>(</span>dst<span style=color:#f92672>)</span>
</code></pre></div><h3 id=删除数据>删除数据</h3><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-bash data-lang=bash><span style=color:#75715e># nGQL</span>
nebula&gt; DELETE VERTEX hash<span style=color:#f92672>(</span><span style=color:#e6db74>&#34;prometheus&#34;</span><span style=color:#f92672>)</span>;
<span style=color:#75715e># Gremlin</span>
gremlin&gt; g.V<span style=color:#f92672>(</span>prometheus<span style=color:#f92672>)</span>.drop<span style=color:#f92672>()</span>;
<span style=color:#75715e># Cypher</span>
cypher&gt; MATCH <span style=color:#f92672>(</span>n:character <span style=color:#f92672>{</span>name:<span style=color:#e6db74>&#34;prometheus&#34;</span><span style=color:#f92672>})</span> DETACH DELETE n 
</code></pre></div><h3 id=更新数据>更新数据</h3><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-bash data-lang=bash><span style=color:#75715e># nGQL</span>
nebula&gt; UPDATE VERTEX hash<span style=color:#f92672>(</span><span style=color:#e6db74>&#34;jesus&#34;</span><span style=color:#f92672>)</span> SET character.type <span style=color:#f92672>=</span> <span style=color:#e6db74>&#39;titan&#39;</span>;
<span style=color:#75715e># Gremlin</span>
gremlin&gt; g.V<span style=color:#f92672>(</span>jesus<span style=color:#f92672>)</span>.property<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;age&#39;</span>, 6000<span style=color:#f92672>)</span>;
<span style=color:#f92672>==</span>&gt;v<span style=color:#f92672>[</span>32<span style=color:#f92672>]</span>
<span style=color:#75715e># Cypher</span>
cypher&gt; MATCH <span style=color:#f92672>(</span>n:character <span style=color:#f92672>{</span>name:<span style=color:#e6db74>&#34;jesus&#34;</span><span style=color:#f92672>})</span> SET n.type <span style=color:#f92672>=</span> <span style=color:#e6db74>&#39;titan&#39;</span>;
</code></pre></div><h3 id=查看数据>查看数据</h3><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-bash data-lang=bash><span style=color:#75715e># nGQL</span>
nebula&gt; FETCH PROP ON character hash<span style=color:#f92672>(</span><span style=color:#e6db74>&#34;saturn&#34;</span><span style=color:#f92672>)</span>;
<span style=color:#f92672>===================================================</span>
| character.name | character.age | character.type |
<span style=color:#f92672>===================================================</span>
| saturn         | <span style=color:#ae81ff>10000</span>         | titan          |
---------------------------------------------------
<span style=color:#75715e># Gremlin</span>
gremlin&gt; g.V<span style=color:#f92672>(</span>saturn<span style=color:#f92672>)</span>.valueMap<span style=color:#f92672>()</span>;
<span style=color:#f92672>==</span>&gt;<span style=color:#f92672>[</span>name:<span style=color:#f92672>[</span>saturn<span style=color:#f92672>]</span>,type:<span style=color:#f92672>[</span>titan<span style=color:#f92672>]</span>,age:<span style=color:#f92672>[</span>10000<span style=color:#f92672>]]</span>
<span style=color:#75715e># Cypher</span>
cypher&gt; MATCH <span style=color:#f92672>(</span>n:character <span style=color:#f92672>{</span>name:<span style=color:#e6db74>&#34;saturn&#34;</span><span style=color:#f92672>})</span> RETURN properties<span style=color:#f92672>(</span>n<span style=color:#f92672>)</span>
  ╒════════════════════════════════════════════╕
  │<span style=color:#e6db74>&#34;properties(n)&#34;</span>                             │
  ╞════════════════════════════════════════════╡
  │<span style=color:#f92672>{</span><span style=color:#e6db74>&#34;name&#34;</span>:<span style=color:#e6db74>&#34;saturn&#34;</span>,<span style=color:#e6db74>&#34;type&#34;</span>:<span style=color:#e6db74>&#34;titan&#34;</span>,<span style=color:#e6db74>&#34;age&#34;</span>:10000<span style=color:#f92672>}</span>│
  └────────────────────────────────────────────┘
</code></pre></div><h3 id=查询-hercules-的父亲>查询 hercules 的父亲</h3><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-bash data-lang=bash><span style=color:#75715e># nGQL</span>
nebula&gt;  LOOKUP ON character WHERE character.name <span style=color:#f92672>==</span> <span style=color:#e6db74>&#39;hercules&#39;</span> | <span style=color:#ae81ff>\
</span><span style=color:#ae81ff></span>      -&gt; GO FROM $-.VertexID OVER father YIELD $$.character.name;
<span style=color:#f92672>=====================</span>
| $$.character.name |
<span style=color:#f92672>=====================</span>
| jupiter           |
---------------------
<span style=color:#75715e># Gremlin</span>
gremlin&gt; g.V<span style=color:#f92672>()</span>.hasLabel<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;character&#39;</span><span style=color:#f92672>)</span>.has<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;name&#39;</span>,<span style=color:#e6db74>&#39;hercules&#39;</span><span style=color:#f92672>)</span>.out<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;father&#39;</span><span style=color:#f92672>)</span>.values<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;name&#39;</span><span style=color:#f92672>)</span>;
<span style=color:#f92672>==</span>&gt;jupiter
<span style=color:#75715e># Cypher</span>
cypher&gt; MATCH <span style=color:#f92672>(</span>src:character<span style=color:#f92672>{</span>name:<span style=color:#e6db74>&#34;hercules&#34;</span><span style=color:#f92672>})</span>-<span style=color:#f92672>[</span>:father<span style=color:#f92672>]</span>-&gt;<span style=color:#f92672>(</span>dst:character<span style=color:#f92672>)</span> RETURN dst.name
      ╒══════════╕
      │<span style=color:#e6db74>&#34;dst.name&#34;</span>│
      ╞══════════╡
      │<span style=color:#e6db74>&#34;jupiter&#34;</span> │
      └──────────┘
</code></pre></div><h3 id=查询-hercules-的祖父>查询 hercules 的祖父</h3><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-bash data-lang=bash><span style=color:#75715e># nGQL</span>
nebula&gt; LOOKUP ON character WHERE character.name <span style=color:#f92672>==</span> <span style=color:#e6db74>&#39;hercules&#39;</span> | <span style=color:#ae81ff>\
</span><span style=color:#ae81ff></span>     -&gt; GO <span style=color:#ae81ff>2</span> STEPS FROM $-.VertexID OVER father YIELD $$.character.name;
<span style=color:#f92672>=====================</span>
| $$.character.name |
<span style=color:#f92672>=====================</span>
| saturn            |
---------------------
<span style=color:#75715e># Gremlin</span>
gremlin&gt; g.V<span style=color:#f92672>()</span>.hasLabel<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;character&#39;</span><span style=color:#f92672>)</span>.has<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;name&#39;</span>,<span style=color:#e6db74>&#39;hercules&#39;</span><span style=color:#f92672>)</span>.out<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;father&#39;</span><span style=color:#f92672>)</span>.out<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;father&#39;</span><span style=color:#f92672>)</span>.values<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;name&#39;</span><span style=color:#f92672>)</span>;
<span style=color:#f92672>==</span>&gt;saturn
<span style=color:#75715e># Cypher</span>
cypher&gt; MATCH <span style=color:#f92672>(</span>src:character<span style=color:#f92672>{</span>name:<span style=color:#e6db74>&#34;hercules&#34;</span><span style=color:#f92672>})</span>-<span style=color:#f92672>[</span>:father*2<span style=color:#f92672>]</span>-&gt;<span style=color:#f92672>(</span>dst:character<span style=color:#f92672>)</span> RETURN dst.name
      ╒══════════╕
      │<span style=color:#e6db74>&#34;dst.name&#34;</span>│
      ╞══════════╡
      │<span style=color:#e6db74>&#34;saturn&#34;</span>  │
      └──────────┘
</code></pre></div><h3 id=查询年龄大于-100-的人物>查询年龄大于 100 的人物</h3><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-bash data-lang=bash><span style=color:#75715e># nGQL</span>
nebula&gt; LOOKUP ON character WHERE character.age &gt; <span style=color:#ae81ff>100</span> YIELD character.name, character.age;
<span style=color:#f92672>=========================================================</span>
| VertexID             | character.name | character.age |
<span style=color:#f92672>=========================================================</span>
| <span style=color:#ae81ff>6761447489613431910</span>  | pluto          | <span style=color:#ae81ff>4000</span>          |
---------------------------------------------------------
| -5860788569139907963 | neptune        | <span style=color:#ae81ff>4500</span>          |
---------------------------------------------------------
| <span style=color:#ae81ff>4863977009196259577</span>  | jupiter        | <span style=color:#ae81ff>5000</span>          |
---------------------------------------------------------
| -4316810810681305233 | saturn         | <span style=color:#ae81ff>10000</span>         |
---------------------------------------------------------
<span style=color:#75715e># Gremlin</span>
gremlin&gt; g.V<span style=color:#f92672>()</span>.hasLabel<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;character&#39;</span><span style=color:#f92672>)</span>.has<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;age&#39;</span>,gt<span style=color:#f92672>(</span>100<span style=color:#f92672>))</span>.values<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;name&#39;</span><span style=color:#f92672>)</span>;
<span style=color:#f92672>==</span>&gt;saturn
<span style=color:#f92672>==</span>&gt;jupiter
<span style=color:#f92672>==</span>&gt;neptune
<span style=color:#f92672>==</span>&gt;pluto
<span style=color:#75715e># Cypher</span>
cypher&gt; MATCH <span style=color:#f92672>(</span>src:character<span style=color:#f92672>)</span> WHERE src.age &gt; <span style=color:#ae81ff>100</span> RETURN src.name
      ╒═══════════╕
      │<span style=color:#e6db74>&#34;src.name&#34;</span> │
      ╞═══════════╡
      │  <span style=color:#e6db74>&#34;saturn&#34;</span> │
      ├───────────┤
      │ <span style=color:#e6db74>&#34;jupiter&#34;</span> │
      ├───────────┤
      │ <span style=color:#e6db74>&#34;neptune&#34;</span> │
      │───────────│
      │  <span style=color:#e6db74>&#34;pluto&#34;</span>  │
      └───────────┘
</code></pre></div><h3 id=从一起居住的人物中排除-pluto-本人>从一起居住的人物中排除 pluto 本人</h3><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-bash data-lang=bash><span style=color:#75715e># nGQL</span>
nebula&gt;  GO FROM hash<span style=color:#f92672>(</span><span style=color:#e6db74>&#34;pluto&#34;</span><span style=color:#f92672>)</span> OVER lives YIELD lives._dst AS place | GO FROM $-.place OVER lives REVERSELY WHERE <span style=color:#ae81ff>\
</span><span style=color:#ae81ff></span>$$.character.name !<span style=color:#f92672>=</span> <span style=color:#e6db74>&#34;pluto&#34;</span> YIELD $$.character.name AS cohabitants;
<span style=color:#f92672>===============</span>
| cohabitants |
<span style=color:#f92672>===============</span>
| cerberus    |
---------------
<span style=color:#75715e># Gremlin</span>
gremlin&gt; g.V<span style=color:#f92672>(</span>pluto<span style=color:#f92672>)</span>.out<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;lives&#39;</span><span style=color:#f92672>)</span>.in<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;lives&#39;</span><span style=color:#f92672>)</span>.where<span style=color:#f92672>(</span>is<span style=color:#f92672>(</span>neq<span style=color:#f92672>(</span>pluto<span style=color:#f92672>)))</span>.values<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;name&#39;</span><span style=color:#f92672>)</span>;
<span style=color:#f92672>==</span>&gt;cerberus
<span style=color:#75715e># Cypher</span>
cypher&gt; MATCH <span style=color:#f92672>(</span>src:character<span style=color:#f92672>{</span>name:<span style=color:#e6db74>&#34;pluto&#34;</span><span style=color:#f92672>})</span>-<span style=color:#f92672>[</span>:lives<span style=color:#f92672>]</span>-&gt;<span style=color:#f92672>()</span>&lt;-<span style=color:#f92672>[</span>:lives<span style=color:#f92672>]</span>-<span style=color:#f92672>(</span>dst:character<span style=color:#f92672>)</span> RETURN dst.name
      ╒══════════╕
      │<span style=color:#e6db74>&#34;dst.name&#34;</span>│
      ╞══════════╡
      │<span style=color:#e6db74>&#34;cerberus&#34;</span>│
      └──────────┘
</code></pre></div><h3 id=pluto-的兄弟们>Pluto 的兄弟们</h3><div class=highlight><pre style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-bash data-lang=bash><span style=color:#75715e># which brother lives in which place?</span>
<span style=color:#75715e>## nGQL</span>
nebula&gt; GO FROM hash<span style=color:#f92672>(</span><span style=color:#e6db74>&#34;pluto&#34;</span><span style=color:#f92672>)</span> OVER brother YIELD brother._dst AS god | <span style=color:#ae81ff>\
</span><span style=color:#ae81ff></span>GO FROM $-.god OVER lives YIELD $^.character.name AS Brother, $$.location.name AS Habitations;
<span style=color:#f92672>=========================</span>
| Brother | Habitations |
<span style=color:#f92672>=========================</span>
| jupiter | sky         |
-------------------------
| neptune | sea         |
-------------------------
<span style=color:#75715e>## Gremlin</span>
gremlin&gt; g.V<span style=color:#f92672>(</span>pluto<span style=color:#f92672>)</span>.out<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;brother&#39;</span><span style=color:#f92672>)</span>.as<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;god&#39;</span><span style=color:#f92672>)</span>.out<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;lives&#39;</span><span style=color:#f92672>)</span>.as<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;place&#39;</span><span style=color:#f92672>)</span>.select<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;god&#39;</span>,<span style=color:#e6db74>&#39;place&#39;</span><span style=color:#f92672>)</span>.by<span style=color:#f92672>(</span><span style=color:#e6db74>&#39;name&#39;</span><span style=color:#f92672>)</span>;
<span style=color:#f92672>==</span>&gt;<span style=color:#f92672>[</span>god:jupiter, place:sky<span style=color:#f92672>]</span>
<span style=color:#f92672>==</span>&gt;<span style=color:#f92672>[</span>god:neptune, place:sea<span style=color:#f92672>]</span>
<span style=color:#75715e>## Cypher</span>
cypher&gt; MATCH <span style=color:#f92672>(</span>src:Character<span style=color:#f92672>{</span>name:<span style=color:#e6db74>&#34;pluto&#34;</span><span style=color:#f92672>})</span>-<span style=color:#f92672>[</span>:brother<span style=color:#f92672>]</span>-&gt;<span style=color:#f92672>(</span>bro:Character<span style=color:#f92672>)</span>-<span style=color:#f92672>[</span>:lives<span style=color:#f92672>]</span>-&gt;<span style=color:#f92672>(</span>dst<span style=color:#f92672>)</span>
RETURN bro.name, dst.name
      ╒═════════════════════════╕
      │<span style=color:#e6db74>&#34;bro.name&#34;</span>    │<span style=color:#e6db74>&#34;dst.name&#34;</span>│
      ╞═════════════════════════╡
      │ <span style=color:#e6db74>&#34;jupiter&#34;</span>    │  <span style=color:#e6db74>&#34;sky&#34;</span>   │
      ├─────────────────────────┤
      │ <span style=color:#e6db74>&#34;neptune&#34;</span>    │ <span style=color:#e6db74>&#34;sea&#34;</span>    │
      └─────────────────────────┘
</code></pre></div><h2 id=推荐阅读>推荐阅读</h2><ul><li><a href=https://nebula-graph.io/cn/posts/graph-database-knowledge-volume-1/>聊聊图数据库和图数据库的小知识</a></li><li><a href=https://nebula-graph.io/cn/posts/integrate-graph-database-with-deep-learning-framework/>Nebula Graph 技术总监陈恒：图数据库怎么和深度学习框架进行结合？</a></li><li><a href=https://nebula-graph.io/cn/posts/graph-database-knowledge-volume-2/>聊聊图数据库和图数据库的小知识 Vol.02</a></li><li><a href=https://nebula-graph.io/cn/posts/graph-database-fans-chat/>图数据库爱好者的聚会在谈论什么？</a></li></ul><blockquote class=star-ads><span>你喜欢这篇文章吗? 喜欢的话，给我们点个</span>
<span class="glyphicon glyphicon-star"></span><span>star 吧:</span>
<a href=https://github.com/vesoft-inc/nebula>https://github.com/vesoft-inc/nebula</a></blockquote><ul class=blog-footer><li><img src=/images/tag.png>
<a href=/nebula-website/cn/tags/%e5%9b%be%e6%95%b0%e6%8d%ae%e5%ba%93%e7%9f%a5%e8%af%86>图数据库知识</a>
<a href=/nebula-website/cn/tags/%e6%9f%a5%e8%af%a2%e8%af%ad%e8%a8%80>查询语言</a></li><li class="nebula-share st-btn"><img src=/images/share.png>
<span>分享</span><ul class=blog-footer-share-links><li class=st-custom-button data-network=wechat><img alt="wechat-white sharing button" src=https://platform-cdn.sharethis.com/img/wechat-white.svg>
<span class=st-label>微信</span></li><li class=st-custom-button data-network=weibo><img alt="weibo-white sharing button" src=https://platform-cdn.sharethis.com/img/weibo-white.svg>
<span class=st-label>微博</span></li><li class=st-custom-button data-network=sharethis><img alt="sharethis-white sharing button" src=https://platform-cdn.sharethis.com/img/sharethis-white.svg>
<span class=st-label>其他</span></li></ul></li><li onclick="location.href='\/nebula-website\/cn\/posts'"><img src=/images/blog.png>
<a href=/nebula-website/cn/posts>返回到博客页</a></li><li onclick="location.href='https:\/\/nebula-graph.io/cn/posts/index.xml'"><img src=/images/rss.png>
<a onclick="window.open('https:\/\/nebula-graph.io/cn/posts/index.xml')" href>RSS</a></li></ul><div id=discourse-comments></div></section><div class=single-side-bar><div class=tags-block><h3 class="glyphicon glyphicon-tag">标签</h3><ul class=blog-tags><li class=col-md-12><a href=/nebula-website/cn/posts class=active>全部</a></li><li><a href=/nebula-website/cn/tags/release-note>release-note</a></li><li><a href=/nebula-website/cn/tags/%E4%BA%A7%E5%93%81%E5%8A%A8%E6%80%81>产品动态</a></li><li><a href=/nebula-website/cn/tags/%E4%BA%A7%E5%93%81%E8%AE%B2%E8%A7%A3>产品讲解</a></li><li><a href=/nebula-website/cn/tags/%E5%9B%BE%E6%95%B0%E6%8D%AE%E5%BA%93%E7%9F%A5%E8%AF%86>图数据库知识</a></li><li><a href=/nebula-website/cn/tags/%E5%BA%94%E7%94%A8%E5%AE%9E%E8%B7%B5>应用实践</a></li><li><a href=/nebula-website/cn/tags/%E5%BC%80%E5%8F%91%E6%97%A5%E5%BF%97>开发日志</a></li><li><a href=/nebula-website/cn/tags/%E6%80%A7%E8%83%BD>性能</a></li><li><a href=/nebula-website/cn/tags/%E6%8A%80%E6%9C%AF%E6%BC%94%E8%AE%B2>技术演讲</a></li><li><a href=/nebula-website/cn/tags/%E6%9E%B6%E6%9E%84%E5%89%96%E6%9E%90>架构剖析</a></li><li><a href=/nebula-website/cn/tags/%E6%9F%A5%E8%AF%A2%E8%AF%AD%E8%A8%80>查询语言</a></li><li><a href=/nebula-website/cn/tags/%E7%89%B9%E6%80%A7%E8%AE%B2%E8%A7%A3>特性讲解</a></li><li><a href=/nebula-website/cn/tags/%E7%A4%BE%E5%8C%BA>社区</a></li><li><a href=/nebula-website/cn/tags/%E7%B3%BB%E7%BB%9F%E6%B5%8B%E8%AF%95>系统测试</a></li><li><a href=/nebula-website/cn/tags/%E7%BC%96%E8%AF%91>编译</a></li><li><a href=/nebula-website/cn/tags/%E9%83%A8%E7%BD%B2>部署</a></li></ul></div><div id=blog-carousel class="carousel slide" data-ride=carousel><ol class=carousel-indicators><li data-target=#blog-carousel data-slide-to=0 class=active></li><li data-target=#blog-carousel data-slide-to=1></li></ol><div class=carousel-inner role=listbox><div class="item active" onclick="location.href='\/cn\/posts\/clean-stale-data-with-ttl-in-nebula-graph\/'"><img src=https://nebula-blog.azureedge.net/nebula-blog/TTL01.png alt="TTL 特性讲解" width=220px height=150px><div class=carousel-caption>TTL 特性讲解</div></div><div class=item onclick="location.href='\/cn\/posts\/github-action-automating-project-process\/'"><img src=https://nebula-blog.azureedge.net/nebula-blog/Action01.png alt="Action 自动化发布" width=220px height=150px><div class=carousel-caption>Action 自动化发布</div></div></div><a class="left carousel-control" href=#blog-carousel role=button data-slide=prev><span class="glyphicon glyphicon-chevron-left" aria-hidden=true></span><span class=sr-only>Previous</span></a>
<a class="right carousel-control" href=#blog-carousel role=button data-slide=next><span class="glyphicon glyphicon-chevron-right" aria-hidden=true></span><span class=sr-only>Next</span></a></div><div class=blog-anchors><h3>目录</h3><nav id=TableOfContents><ul><li><a href=#图查询语言介绍>图查询语言·介绍</a><ul><li><a href=#图查询语言-gremlin>图查询语言 Gremlin</a></li><li><a href=#图查询语言-cypher>图查询语言 Cypher</a></li><li><a href=#图查询语言-ngql>图查询语言 nGQL</a></li></ul></li><li><a href=#图查询语言术语篇>图查询语言·术语篇</a></li><li><a href=#图查询语言语法篇>图查询语言·语法篇</a><ul><li><a href=#图>图</a></li><li><a href=#点>点</a></li><li><a href=#边>边</a></li><li><a href=#其他操作>其他操作</a></li></ul></li><li><a href=#图查询语言实操篇>图查询语言·实操篇</a><ul><li><a href=#示例图the-graphs-of-gods>示例图：The Graphs of Gods</a></li><li><a href=#插入数据>插入数据</a></li><li><a href=#删除数据>删除数据</a></li><li><a href=#更新数据>更新数据</a></li><li><a href=#查看数据>查看数据</a></li><li><a href=#查询-hercules-的父亲>查询 hercules 的父亲</a></li><li><a href=#查询-hercules-的祖父>查询 hercules 的祖父</a></li><li><a href=#查询年龄大于-100-的人物>查询年龄大于 100 的人物</a></li><li><a href=#从一起居住的人物中排除-pluto-本人>从一起居住的人物中排除 pluto 本人</a></li><li><a href=#pluto-的兄弟们>Pluto 的兄弟们</a></li></ul></li><li><a href=#推荐阅读>推荐阅读</a></li></ul></nav></div><div class=social-share><h3>分享</h3><div class=nebula-share-buttons><div class="st-custom-button st-remove-label" data-network=wechat><img alt="wechat-white sharing button" src=https://platform-cdn.sharethis.com/img/wechat-white.svg></div><div class="st-custom-button st-remove-label" data-network=weibo><img alt="weibo-white sharing button" src=https://platform-cdn.sharethis.com/img/weibo-white.svg></div><div class="st-custom-button st-remove-label" data-network=twitter><img alt="twitter-white sharing button" src=https://platform-cdn.sharethis.com/img/twitter-white.svg></div><div class="st-custom-button st-remove-label" data-network=linkedin><img alt="linkedin-white sharing button" src=https://platform-cdn.sharethis.com/img/linkedin-white.svg></div><div class="st-custom-button st-remove-label" data-network=facebook><img alt="facebook-white sharing button" src=https://platform-cdn.sharethis.com/img/facebook-white.svg></div><div class="st-custom-button st-remove-label" data-network=hackernews><img alt="hackernews-white sharing button" src=https://platform-cdn.sharethis.com/img/hackernews-white.svg></div><div class="st-custom-button st-remove-label" data-network=reddit><img alt="reddit-white sharing button" src=https://platform-cdn.sharethis.com/img/reddit-white.svg></div><div class="st-custom-button st-remove-label" data-network=sharethis><img alt="reddit-white sharing button" src=https://platform-cdn.sharethis.com/img/sharethis-white.svg></div></div></div></div></div><img onclick="location.href='#top'" class=go-ahead src=/images/up.png></div><footer class="container-fluid foot-wrap" name=contact_us><div class=container><p align=center class=statement>Nebula Graph will respect your data privacy per our Privacy Policy</p><div class=row><div class="row-content col-lg-4 col-sm-4 col-xs-4"><h3>Community</h3><ul><li><img src=/img/github.png>
<a href=https://github.com/vesoft-inc/nebula target=_blank>GitHub</a></li><li><img src=/img/forum.png>
<a href=https://discuss.nebula-graph.io/ target=_blank>论坛</a></li><li><img src=/img/slack.png>
<a href=https://join.slack.com/t/nebulagraph/shared_invite/enQtNjIzMjQ5MzE2OTQ2LTM0MjY0MWFlODg3ZTNjMjg3YWU5ZGY2NDM5MDhmOGU2OWI5ZWZjZDUwNTExMGIxZTk2ZmQxY2Q2MzM1OWJhMmY# target=_blank>Slack</a></li></ul></div><div class="row-content col-lg-4 col-sm-4 col-xs-4"><h3>Follow Us</h3><ul><li><img src=/img/twitter.png>
<a href=https://twitter.com/NebulaGraph title=Twitter data-toggle=modal target=_blank data-target>Twitter</a></li><li><img src=/img/weibo.png>
<a href=https://weibo.com/nebulagraph title=微博 data-toggle=modal target=_blank data-target>微博</a></li><li><img src=/img/linkedin.png>
<a href=https://www.linkedin.com/company/vesoft-nebula-graph/ title=LinkedIn data-toggle=modal target=_blank data-target>LinkedIn</a></li><li><img src=/img/youtube.png>
<a href=https://www.youtube.com/channel/UC73V8q795eSEMxDX4Pvdwmw title=YouTube data-toggle=modal target=_blank data-target>YouTube</a></li><li><img src=/img/facebook.png>
<a href=https://www.facebook.com/NebulaGraph/ title=FaceBook data-toggle=modal target=_blank data-target>FaceBook</a></li><li><img src=/img/gongzhonghao.png>
<a href title=微信公众号 data-toggle=modal target=_blank data-target=#myGongzhonghaoModal>微信公众号</a></li></ul></div><div class="contactus row-content col-lg-4 col-sm-4 col-xs-4"><h3>Contact Us</h3><ul><li><img src=/img/iphone.png>
<a href data-toggle=modal target=_blank data-target>(+86) 0571-28120658</a></li><li><img src=/img/email.png>
<a href=mailto:info@vesoft.com data-toggle=modal target=_blank data-target>info@vesoft.com</a></li><li><img src=/img/weixin.png>
<a href data-toggle=modal target=_blank data-target=#myModal>微信个人助理</a></li></ul></div></div></div><p align=left style=font-size:16px><img src=/images/VEsoft.png style=margin-right:10px> Copyright &copy;2020 VESoft Inc</p><div class="modal fade" id=myGongzhonghaoModal tabindex=-1 role=dialog aria-labelledby=myModalLabel aria-hidden=true><div class=modal-dialog><div class=modal-content><div class="modal-body wechat"><img src=/images/gonggonghaoCODE.jpg></div><div class=modal-footer><button type=button class="btn btn-default" data-dismiss=modal>close</button></div></div></div></div><div class="modal fade" id=myModal tabindex=-1 role=dialog aria-labelledby=myModalLabel aria-hidden=true><div class=modal-dialog><div class=modal-content><div class="modal-body wechat"><img src=/images/wechat.png></div><div class=modal-footer><button type=button class="btn btn-default" data-dismiss=modal>close</button></div></div></div></div></footer></main><div id=J-star-popup class=nebula-star-popup></div><script src=/nebula-website/js/jquery.js></script><script src=/nebula-website/js/bootstrap.min.js></script><script src=/nebula-website/js/jquery.easing.min.js></script><script src=/nebula-website/js/jquery.fittext.js></script><script src=/nebula-website/js/wow.min.js></script><script type=text/javascript src="https://platform-api.sharethis.com/js/sharethis.js#property=5e7c2cc315c7990012ae38bc&product=inline-share-buttons" async></script><script src=/nebula-website/js/creative.js></script><script async defer src=https://buttons.github.io/buttons.js></script><script src=/nebula-website/js/init.js></script><script type=text/javascript>DiscourseEmbed={discourseUrl:'https://discuss.nebula-graph.io/',discourseEmbedUrl:"\/nebula-website\/cn\/posts\/graph-query-language-comparison-cypher-gremlin-ngql\/"};(function(){var d=document.createElement('script');d.type='text/javascript';d.async=true;d.src=DiscourseEmbed.discourseUrl+'javascripts/embed.js';(document.getElementsByTagName('head')[0]||document.getElementsByTagName('body')[0]).appendChild(d);})();</script></body></html>